# 1) Django არის Python-ის ძლიერი ვებ-ფრეიმვორკი, რომელიც გამოიყენება ვებ-გვერდებისა და აპლიკაციების ბექენდი სწრაფად და უსაფრთხოდ შესაქმნელად.
# 2) როგორც Full-Stack: Django აკეთებს ყველაფერს. ბექენდ კოდიც და საიტის ვიზუალიც ერთად იწერება მისი ტემპლეიტების სისტემის მეშვეობით და ამის მეშვეობით, ბრაუზერი პირდაპირ მზად ვებსაიტს იღებს.
# 3) Django-ს უპირატესობაა, სისწრაფე:ბაზის მართვა და Admin პანელი. MERN-ში ეს ყველაფერი ნულიდან უნდა ავაწყოთ და ნაკლები მოქნილობა Django გვაიძულებს ვწეროთ მისი წესებით.MERN უფრო თავისუფალია.
# 4) Django იყენებს MVT არქიტექტურას. ეს არის პოპულარული MVC არქიტექტურა, სადაც Controller-ის როლს თავად ფრეიმვორკი ასრულებს.
# 5)  Model (მოდელი): პასუხისმგებელია მონაცემებზე. ის განსაზღვრავს, თუ რა სტრუქტურა ექნება მონაცემთა ბაზას (მაგ. მომხმარებლის სახელი, პაროლი).
# View (ხედი): აპლიკაციის "ტვინი". ის იღებს მოთხოვნას ბრაუზერიდან, მიაქვს/მოაქვს მონაცემები ბაზიდან (Model) და წყვეტს, რა პასუხი დააბრუნოს.
# Template (შაბლონი): ვიზუალური მხარე (HTML), სადაც View-ს მიერ გამოგზავნილი მონაცემები ლამაზად აისახება მომხმარებლისთვის.
# 6) ORM (Object-Relational Mapping) არის ტექნოლოგია, რომელიც მონაცემთა ბაზის ცხრილებს აქცევს Python-ის ობიექტებად. რატომაა კარგი: არ გიწევს რთული SQL კოდის წერა. 
# 7) გამოიყენება Django, როცა: ვაშენებთ დიდ,  პროექტს, სადაც თავიდანვე გვჭირდება მომხმარებლების ბაზა, ავტორიზაცია და ბევრი ცხრილი.
# 8) Django პროექტი, შედგება დამოუკიდებელი მოდულებისგან. აპლიკაციებისგან. აპლიკაცია არის პროექტის ერთერთი ნაწილი, რომელიც ერთ კონკრეტულ ფუნქციას ასრულებს.